
# 1) შეამოწმე არის თუ არა ორი ცვლადიდან ერთი მაინც მართალი

num1=True
num2=False

if num1 or num2:
    print("მხოლოდ ერთი არსი სწორი") 
else:
    print("მხოლოდ ერთი რიცხვია არასწორი")



# 2) შეამოწმე ორივე ცვლადი  მართალია თუ არა

um1=True
num2=False

if num1 or num2:
    print("მხოლოდ ერთი არსი სწორი") 
else:
    print("მხოლოდ ერთი რიცხვია არასწორი")

# 3) შეამოწმე არის თუ არა ორი რიცხვი თანაბარი  ან პირველი რიცხვი მეტი მეორეზე.

a=7
b=10

if a < b:
    print("b მეტია a-ზე")
elif a < b:
    print("a მეტია b-ზე")
elif a == b:
    print("a==b")
else:
    print("a ნაკლებია b-ზე")

#(4 შეამოწმე არის თუ არა ბავშვის ასაკი 6-დან 12 წლამდე.

age = int(input("გთხოვთ, შეიყვანოთ ბავშვის ასაკი: "))

if 6 <= age <= 12:
    print("ბავშვი არის 6-დან 12 წლამდე.")
else:
    print("ბავშვი არ არის 6-დან 12 წლამდე.")



#5) bonus (მოცემურია ორი ლოგიკური ცვლადი. მათი საწინააღმდეგო მმნიშვნელობა გამოთვალე მხოლოდ and და or ოპერატორების გამოყენებით)
a = True
b = False

not_a = (a and False) or True  
not_b = (b and False) or True  

print("a-ის საწინააღმდეგო მნიშვნელობა:", not_a)
print("b-ის საწინააღმდეგო მნიშვნელობა:", not_b)
